/*
Task 1 👨‍🏫
Пользователь решил повеселиться и ввел свое имя в таком ввиде 'пОлИнА нАбЕрЕжНаЯ'

Испрвьте эту ситацию чтобы мы смогли корректно поприветсвовать пользователя, и поприветствуйте его через alert

Привет, Полина Набережная!
*/

/*
Task 3 💻
Написать функцию trimString которая в качестве аргумента принимает три параметра:

строку
значение от
значение по
После вызова функция должна вернуть переданную строку обрезанную по значениям от и по
*/

//Task 6 (52)

/*
Даны два одинаковых объекта. Сравните их так чтобы они были равны

    let student1 = {
        name: 'Polina',
        age: 27,
    }

    let student2 = {
        name: 'Polina',
        age: 27,
    }
*/
